{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_batchnorm0_running_var", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_batchnorm0_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[2, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_batchnorm0_running_mean", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[12, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_batchnorm0_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[10, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu0", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm0_running_var", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm0_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[21, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm0_running_mean", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[31, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm0_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[29, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu1", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm1_running_var", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm1_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[39, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm1_running_mean", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[49, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm1_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[47, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add0", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[19, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu2", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm2_running_var", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm2_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[58, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm2_running_mean", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[68, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm2_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[66, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu3", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm3_running_var", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm3_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[76, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm3_running_mean", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[86, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_batchnorm3_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[84, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add1", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[56, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu4", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm2_running_var", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm2_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[95, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm2_running_mean", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[105, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm2_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[103, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[93, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm0_running_var", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm0_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[112, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm0_running_mean", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[122, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm0_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[120, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu5", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm1_running_var", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm1_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[134, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[130, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm1_running_mean", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[140, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm1_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[141, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[138, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add2", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[110, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu6", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[147, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm3_running_var", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm3_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[153, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[149, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm3_running_mean", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[159, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm3_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[157, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu7", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_conv4_weight", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[165, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm4_running_var", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm4_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[171, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[167, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm4_running_mean", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[177, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_batchnorm4_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[175, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add3", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[147, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_5", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[184, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_batchnorm2_running_var", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_batchnorm2_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[190, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[186, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_batchnorm2_running_mean", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[196, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_batchnorm2_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[197, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[194, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_6", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[184, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_batchnorm0_running_var", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[205, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_batchnorm0_gamma", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[209, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[203, 0, 0], [210, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_batchnorm0_running_mean", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[213, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_batchnorm0_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[214, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[216, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[211, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu9", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_3", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_7", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[219, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_batchnorm1_running_var", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm12_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[222, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm12_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm12_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[224, 0, 0]]
    }, 
